In [ ]:
index 접근하기
    d.index
    대체만 가능
    수정: d.rename(index = dict)
        
columns 접근하기
    d.columns
    대체만 가능
    수정: d.rename(columns = dict)
    
값 접근하기
    d.values
    수정만 가능, 대체는 불가

In [ ]:
Pandas : 부분 정보 선택하기
    
[ ]을 이용한 선택
    열 indexing : df[column명]or df[column명 리스트]
    행 slicing: df[슬라이싱 범위] or df[True, False 리스트]

In [1]:
import numpy as np
import pandas as pd

In [2]:
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
                     '국어': [87, 15, 84, 87, 99, 77], \
                     '영어': [78, 84, 76, 99, 59, 56]}
d = pd.DataFrame(scoresWithLectures, index = names)
d

      수학  국어  영어
둘리    84  87  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [11]:
d.rename(index = {'길동':'수영'})

      수학  국어  영어
둘리    84  87  78
호이    21  15  84
영미    87  84  76
수영   100  87  99
또치    59  99  59
마이클   46  77  56

In [12]:
d

      수학  국어  영어
둘리    84  87  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [13]:
d.rename(index = {'길동':'수영'}, inplace = True)   # 수정값이 반환값이 아니라 원본 수정하도록 함

In [14]:
d

      수학  국어  영어
둘리    84  87  78
호이    21  15  84
영미    87  84  76
수영   100  87  99
또치    59  99  59
마이클   46  77  56

In [18]:
d.rename(columns = {'수학':'사회', '영어':'국사'}, inplace = True)

In [19]:
d

      사회  국어  국사
둘리    84  87  78
호이    21  15  84
영미    87  84  76
수영   100  87  99
또치    59  99  59
마이클   46  77  56

In [ ]:
indexing, slicing 예시

In [20]:
names = ['둘리', '호이', '영미', '길동', '또치', '마이클']
scoresWithLectures = {'수학': [84, 21, 87, 100, 59, 46], \
                     '국어': [87, 15, 84, 87, 99, 77], \
                     '영어': [78, 84, 76, 99, 59, 56]}
d = pd.DataFrame(scoresWithLectures, index = names)
d

      수학  국어  영어
둘리    84  87  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [ ]:
# d[행만 선택가능]
# d.loc[(열 조건으로) 행 선택, (행 조건으로) 열 선택]

In [21]:
d['수학']   # 행만 선택 가능

둘리      84
호이      21
영미      87
길동     100
또치      59
마이클     46
Name: 수학, dtype: int64

In [22]:
d['둘리']    # index명 입력 불가. 행이름이 들어가야 함.

KeyError: '둘리'

In [24]:
d[['수학', '국어']]   # 콤마로 된 리스트로 선택하여 여러 개를 선택(indexing을 여러 개 함)

      수학  국어
둘리    84  87
호이    21  15
영미    87  84
길동   100  87
또치    59  99
마이클   46  77

In [27]:
d[['국어', '수학']]   # 컬럼 순서를 바꿔서 적으면 그대로 반환됨. 뽑는 형태는 열이 선택됨.

     국어   수학
둘리   87   84
호이   15   21
영미   84   87
길동   87  100
또치   99   59
마이클  77   46

In [30]:
d['호이':'길동']    # 콜론(:) 사용하여 범위로 하는 것은 행이 선택됨. 슬라이싱

     수학  국어  영어
호이   21  15  84
영미   87  84  76
길동  100  87  99

In [ ]:
d[2:5]    # 번호로 슬라이싱 가능

In [31]:
d[[True, False, True, True, False, False]]   # True인 행이 선택됨. 전체 행 갯수를 맞춰서 줘야 함

     수학  국어  영어
둘리   84  87  78
영미   87  84  76
길동  100  87  99

In [ ]:
Pandas : 부분 정보 선택하기
    
loc와 iloc를 이용한 행 선택
    열 추가시 comma 사용
    loc: lable/index based indexing -> index 이름(label)으로 접근
        # 숫자 index명도 헷갈리지 않게 사용가능
    iloc: integer-location based indexing -> 번호로 접근
        # 첫 행이 0번

In [35]:
d.loc['둘리']

수학    84
국어    87
영어    78
Name: 둘리, dtype: int64

In [37]:
d.loc['둘리':'영미']   # 슬라이싱

    수학  국어  영어
둘리  84  87  78
호이  21  15  84
영미  87  84  76

In [38]:
d.loc[['둘리','영미']]    # 콤마로 연결된 리스트

    수학  국어  영어
둘리  84  87  78
영미  87  84  76

In [40]:
d.loc['둘리', '수학']   # 행 고르고 열 골랐음

84

In [42]:
d.loc['둘리', '수학':'국어']

수학    84
국어    87
Name: 둘리, dtype: int64

In [43]:
d.loc['둘리', ['수학', '영어']]

수학    84
영어    78
Name: 둘리, dtype: int64

In [44]:
d.loc['둘리':'영미', ['수학', '영어']]

    수학  영어
둘리  84  78
호이  21  84
영미  87  76

In [45]:
d.loc['둘리':'영미', '수학':'영어']

    수학  국어  영어
둘리  84  87  78
호이  21  15  84
영미  87  84  76

In [49]:
d.loc[:, '수학':'국어']   # loc에서 행을 모두 선택 후 원하는 열 선택

      수학  국어
둘리    84  87
호이    21  15
영미    87  84
길동   100  87
또치    59  99
마이클   46  77

In [50]:
d[['수학', '영어']]

      수학  영어
둘리    84  78
호이    21  84
영미    87  76
길동   100  99
또치    59  59
마이클   46  56

In [ ]:
iloc 연습

In [39]:
d.iloc[0, [0, 1]]

수학    84
국어    87
Name: 둘리, dtype: int64

In [51]:
d.iloc[2, [0, 2]]

수학    87
영어    76
Name: 영미, dtype: int64

In [52]:
d.loc['또치':'마이클']

     수학  국어  영어
또치   59  99  59
마이클  46  77  56

In [53]:
d.loc['영미':'마이클']

      수학  국어  영어
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [55]:
d.loc[['영미', '마이클']]

     수학  국어  영어
영미   87  84  76
마이클  46  77  56

In [61]:
d.iloc[0:2]

    수학  국어  영어
둘리  84  87  78
호이  21  15  84

In [60]:
d.iloc[2:5]

     수학  국어  영어
영미   87  84  76
길동  100  87  99
또치   59  99  59

In [57]:
d.iloc[2:6]

      수학  국어  영어
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [59]:
d.iloc[2:9]

      수학  국어  영어
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [62]:
d.iloc[[2, 5]]

     수학  국어  영어
영미   87  84  76
마이클  46  77  56

In [63]:
d['수학']

둘리      84
호이      21
영미      87
길동     100
또치      59
마이클     46
Name: 수학, dtype: int64

In [68]:
d[:, '수학':'영어']

TypeError: '(slice(None, None, None), slice('수학', '영어', None))' is an invalid key

In [66]:
d[['수학','영어']]

      수학  영어
둘리    84  78
호이    21  84
영미    87  76
길동   100  99
또치    59  59
마이클   46  56

In [70]:
d.loc[['수학':'영어']]

SyntaxError: invalid syntax (<ipython-input-70-fa22fc4ee855>, line 1)

In [74]:
d.loc['둘리']

수학    84
국어    87
영어    78
Name: 둘리, dtype: int64

In [73]:
type(d.loc['둘리'])

pandas.core.series.Series

In [71]:
d.loc[['둘리']]

    수학  국어  영어
둘리  84  87  78

In [72]:
type(d.loc[['둘리']])

pandas.core.frame.DataFrame

In [75]:
d['수학']

둘리      84
호이      21
영미      87
길동     100
또치      59
마이클     46
Name: 수학, dtype: int64

In [ ]:
index 부분에 이름 붙여보기

In [76]:
d.index.name = '이름'

In [77]:
d.columns.name = '과목'

In [78]:
d

과목    수학  국어  영어
이름
둘리    84  87  78
호이    21  15  84
영미    87  84  76
길동   100  87  99
또치    59  99  59
마이클   46  77  56

In [ ]:
특정열을 index화 시킬 수 있음

In [79]:
d['수학']

이름
둘리      84
호이      21
영미      87
길동     100
또치      59
마이클     46
Name: 수학, dtype: int64

In [80]:
d['영미']

KeyError: '영미'

In [81]:
d.loc['영미']

과목
수학    87
국어    84
영어    76
Name: 영미, dtype: int64

In [ ]:
Pandas : 산술/논리 연산 및 색인

산술연산
    배열과 Series와 비슷
    예시

In [82]:
d.iloc[0] + d.iloc[1]

과목
수학    105
국어    102
영어    162
dtype: int64

In [83]:
d['수학'] + d['국어']

이름
둘리     171
호이      36
영미     171
길동     187
또치     158
마이클    123
dtype: int64

In [84]:
d.sum()

과목
수학    397
국어    449
영어    452
dtype: int64

In [86]:
d.sum(axis = 0)   # 행 방향은 0번축, 열 방향은 1번축

과목
수학    397
국어    449
영어    452
dtype: int64

In [85]:
d.sum(axis = 1)

이름
둘리     249
호이     120
영미     247
길동     286
또치     217
마이클    179
dtype: int64

In [ ]:
예시.  합계 추가하기

In [90]:
d.loc[6] = d.sum()

In [88]:
d

과목    수학   국어   영어
이름
둘리    84   87   78
호이    21   15   84
영미    87   84   76
길동   100   87   99
또치    59   99   59
마이클   46   77   56
6    397  449  452

In [91]:
d.loc['합'] = d.sum()    # 재실행시 '합'열이 있어서 그 '합'값을 포함하여 합이 2배가 됨. 있었으면 수정, 없었으면 추가됨

In [92]:
d

과목     수학    국어    영어
이름
둘리     84    87    78
호이     21    15    84
영미     87    84    76
길동    100    87    99
또치     59    99    59
마이클    46    77    56
6     794   898   904
합    1191  1347  1356

In [115]:
d.loc['합'] = d.sum(axis = 1)

In [116]:
d

과목      수학     국어     영어       합
이름
둘리    84.0   87.0   78.0   249.0
호이    21.0   15.0   84.0   120.0
영미    87.0   84.0   76.0   247.0
길동   100.0   87.0   99.0   286.0
또치    59.0   99.0   59.0   217.0
마이클   46.0   77.0   56.0   179.0
6    794.0  898.0  904.0  2596.0
합      NaN    NaN    NaN  7788.0

In [95]:
d['합'] = d.sum(axis = 1)

In [96]:
d

과목      수학     국어     영어       합
이름
둘리    84.0   87.0   78.0   249.0
호이    21.0   15.0   84.0   120.0
영미    87.0   84.0   76.0   247.0
길동   100.0   87.0   99.0   286.0
또치    59.0   99.0   59.0   217.0
마이클   46.0   77.0   56.0   179.0
6    794.0  898.0  904.0  2596.0
합      NaN    NaN    NaN     0.0

In [101]:
del d['합']

In [102]:
d

과목      수학     국어     영어
이름
둘리    84.0   87.0   78.0
호이    21.0   15.0   84.0
영미    87.0   84.0   76.0
길동   100.0   87.0   99.0
또치    59.0   99.0   59.0
마이클   46.0   77.0   56.0
6    794.0  898.0  904.0
합      NaN    NaN    NaN

In [107]:
d['합'] = d.sum(axis = 1)

In [108]:
d

과목      수학     국어     영어       합
이름
둘리    84.0   87.0   78.0   249.0
호이    21.0   15.0   84.0   120.0
영미    87.0   84.0   76.0   247.0
길동   100.0   87.0   99.0   286.0
또치    59.0   99.0   59.0   217.0
마이클   46.0   77.0   56.0   179.0
6    794.0  898.0  904.0  2596.0
합      NaN    NaN    NaN     0.0

In [ ]:
논리 연산과 색인
    Array와 Series와 비슷
    예시
    d['수학'] > 60
    d[d['수학'] > 60]['영어']
    d.loc[d['수학'] > 60, '영어']

In [133]:
d['수학']

이름
둘리      84.0
호이      21.0
영미      87.0
길동     100.0
또치      59.0
마이클     46.0
6      794.0
합        NaN
Name: 수학, dtype: float64

In [109]:
d['수학'] > 60   # True/False가 들어갔을 때는 행 선택임

이름
둘리      True
호이     False
영미      True
길동      True
또치     False
마이클    False
6       True
합      False
Name: 수학, dtype: bool

In [110]:
d[d['수학'] > 60]['영어']

이름
둘리     78.0
영미     76.0
길동     99.0
6     904.0
Name: 영어, dtype: float64

In [134]:
d[d['수학'] > 60]['수학']

이름
둘리     84.0
영미     87.0
길동    100.0
6     794.0
Name: 수학, dtype: float64

In [111]:
d[d['수학'] > 60]

과목     수학     국어     영어       합
이름
둘리   84.0   87.0   78.0   249.0
영미   87.0   84.0   76.0   247.0
길동  100.0   87.0   99.0   286.0
6   794.0  898.0  904.0  2596.0

In [112]:
d.loc[d['수학'] > 60]

과목     수학     국어     영어       합
이름
둘리   84.0   87.0   78.0   249.0
영미   87.0   84.0   76.0   247.0
길동  100.0   87.0   99.0   286.0
6   794.0  898.0  904.0  2596.0

In [132]:
d.loc[d['수학'] > 60, '영어']

이름
둘리     78.0
영미     76.0
길동     99.0
6     904.0
Name: 영어, dtype: float64

In [113]:
d.loc[d['수학'] > 60, ['국어']]

과목     국어
이름
둘리   87.0
영미   84.0
길동   87.0
6   898.0

In [117]:
d.loc[d['수학'] > 60, d.loc['둘리'] > 80]

과목     수학     국어       합
이름
둘리   84.0   87.0   249.0
영미   87.0   84.0   247.0
길동  100.0   87.0   286.0
6   794.0  898.0  2596.0

In [119]:
d.loc[d['수학'] < 85, d.loc['둘리'] > 80]

과목     수학    국어      합
이름
둘리   84.0  87.0  249.0
호이   21.0  15.0  120.0
또치   59.0  99.0  217.0
마이클  46.0  77.0  179.0

In [120]:
d.loc[d.loc['둘리'] > 80]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [121]:
d.loc[:, d.loc['둘리'] > 80]

과목      수학     국어       합
이름
둘리    84.0   87.0   249.0
호이    21.0   15.0   120.0
영미    87.0   84.0   247.0
길동   100.0   87.0   286.0
또치    59.0   99.0   217.0
마이클   46.0   77.0   179.0
6    794.0  898.0  2596.0
합      NaN    NaN  7788.0

In [118]:
d.loc[d.loc['둘리'] > 80, d['수학'] < 85]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [122]:
d.loc[[d.loc['둘리'] > 80, d.loc['마이클'] > 80], d['수학'] < 85]

ValueError: too many values to unpack (expected 1)

In [125]:
d['영어']

이름
둘리      78.0
호이      84.0
영미      76.0
길동      99.0
또치      59.0
마이클     56.0
6      904.0
합        NaN
Name: 영어, dtype: float64

In [128]:
d.loc[d['영어']>80]

과목     수학     국어     영어       합
이름
호이   21.0   15.0   84.0   120.0
길동  100.0   87.0   99.0   286.0
6   794.0  898.0  904.0  2596.0

In [129]:
d.loc[d['영어']>80, d.loc['호이'] > 80]

과목     영어       합
이름
호이   84.0   120.0
길동   99.0   286.0
6   904.0  2596.0

In [154]:
d1 = d.loc[(d['영어']>50) & (d['수학']>50), d.loc['호이'] > 10]

In [155]:
d1

과목     수학     국어     영어       합
이름
둘리   84.0   87.0   78.0   249.0
영미   87.0   84.0   76.0   247.0
길동  100.0   87.0   99.0   286.0
또치   59.0   99.0   59.0   217.0
6   794.0  898.0  904.0  2596.0

In [135]:
d.loc[d['영어']>80, d.loc['호이'] > 80]

과목     영어       합
이름
호이   84.0   120.0
길동   99.0   286.0
6   904.0  2596.0

In [ ]:
여러 조건 연산

d['수학']>60
d['영어']>80

(d['수학']>60) & (d['영어']>80)
# 우선순위를 지정하려고 괄호( )를 사용함
# and는 벡터 연산(배열끼리의 연산 등)인데 DataFrame에서는 지원 안함
# &는 비트와이즈 연산임: 벡터연산이 지원됨

In [158]:
3 and 5   # 둘 다 0이상이라 True인 1로 나옴 (0이 아닌 수)

5

In [159]:
3 & 5    # 비트와이즈 연산

1

In [161]:
True and 5

5

In [165]:
(d['수학']>50) & (d['영어']>60)

이름
둘리      True
호이     False
영미      True
길동      True
또치     False
마이클    False
6       True
합      False
dtype: bool

In [166]:
d.loc[(d['수학']>50) & (d['영어']>60)]

과목     수학     국어     영어       합
이름
둘리   84.0   87.0   78.0   249.0
영미   87.0   84.0   76.0   247.0
길동  100.0   87.0   99.0   286.0
6   794.0  898.0  904.0  2596.0

In [167]:
d.loc[(d['수학']>50) & (d['영어']>60), '합']

이름
둘리     249.0
영미     247.0
길동     286.0
6     2596.0
Name: 합, dtype: float64

In [168]:
d.loc[d['수학']>50, d.loc['또치']>50]   # d.loc[(열 조건으로) 행 선택, (행 조건으로) 열 선택]

과목     수학     국어     영어       합
이름
둘리   84.0   87.0   78.0   249.0
영미   87.0   84.0   76.0   247.0
길동  100.0   87.0   99.0   286.0
또치   59.0   99.0   59.0   217.0
6   794.0  898.0  904.0  2596.0

In [136]:
d.loc['둘리']

과목
수학     84.0
국어     87.0
영어     78.0
합     249.0
Name: 둘리, dtype: float64

In [140]:
d['수학']

이름
둘리      84.0
호이      21.0
영미      87.0
길동     100.0
또치      59.0
마이클     46.0
6      794.0
합        NaN
Name: 수학, dtype: float64

In [139]:
d.loc[:, '수학']

이름
둘리      84.0
호이      21.0
영미      87.0
길동     100.0
또치      59.0
마이클     46.0
6      794.0
합        NaN
Name: 수학, dtype: float64

In [156]:
d[['수학', '영어']]

과목      수학     영어
이름
둘리    84.0   78.0
호이    21.0   84.0
영미    87.0   76.0
길동   100.0   99.0
또치    59.0   59.0
마이클   46.0   56.0
6    794.0  904.0
합      NaN    NaN

In [ ]:
Pandas : 데이터 추가/삭제

행/열 추가

In [ ]:
Pandas : 데이터 추가/삭제

drop 함수 -  열/행 제거
    행 제거: d.drop(index명)   # index명은 행 선택, axis = 0이 생략된 것임  # 반환하는 거라 원본은 그대로임
    열 제거: d.drop(index명)
    inplace = True: 자체적으로 수정됨(반환x)
    리스트 형태로 여러 개의 index명과 columa명 지정 가능

del - 열 제거
    del df[columa명]
    
    # d.loc[]는 추가, 수정만 가능하고 삭제 불가

In [ ]:
예시

In [169]:
d

과목      수학     국어     영어       합
이름
둘리    84.0   87.0   78.0   249.0
호이    21.0   15.0   84.0   120.0
영미    87.0   84.0   76.0   247.0
길동   100.0   87.0   99.0   286.0
또치    59.0   99.0   59.0   217.0
마이클   46.0   77.0   56.0   179.0
6    794.0  898.0  904.0  2596.0
합      NaN    NaN    NaN  7788.0

In [173]:
d.drop(6)

과목      수학    국어    영어       합
이름
둘리    84.0  87.0  78.0   249.0
호이    21.0  15.0  84.0   120.0
영미    87.0  84.0  76.0   247.0
길동   100.0  87.0  99.0   286.0
또치    59.0  99.0  59.0   217.0
마이클   46.0  77.0  56.0   179.0
합      NaN   NaN   NaN  7788.0

In [174]:
d.drop('합')

과목      수학     국어     영어       합
이름
둘리    84.0   87.0   78.0   249.0
호이    21.0   15.0   84.0   120.0
영미    87.0   84.0   76.0   247.0
길동   100.0   87.0   99.0   286.0
또치    59.0   99.0   59.0   217.0
마이클   46.0   77.0   56.0   179.0
6    794.0  898.0  904.0  2596.0

In [175]:
d.drop(6, inplace = True)

In [176]:
d

과목      수학    국어    영어       합
이름
둘리    84.0  87.0  78.0   249.0
호이    21.0  15.0  84.0   120.0
영미    87.0  84.0  76.0   247.0
길동   100.0  87.0  99.0   286.0
또치    59.0  99.0  59.0   217.0
마이클   46.0  77.0  56.0   179.0
합      NaN   NaN   NaN  7788.0

In [179]:
d.drop('합')

과목      수학    국어    영어      합
이름
둘리    84.0  87.0  78.0  249.0
호이    21.0  15.0  84.0  120.0
영미    87.0  84.0  76.0  247.0
길동   100.0  87.0  99.0  286.0
또치    59.0  99.0  59.0  217.0
마이클   46.0  77.0  56.0  179.0

In [180]:
d.drop('합', axis = 1)

과목      수학    국어    영어
이름
둘리    84.0  87.0  78.0
호이    21.0  15.0  84.0
영미    87.0  84.0  76.0
길동   100.0  87.0  99.0
또치    59.0  99.0  59.0
마이클   46.0  77.0  56.0
합      NaN   NaN   NaN

In [181]:
d.drop('합', inplace = True)

In [182]:
d

과목      수학    국어    영어      합
이름
둘리    84.0  87.0  78.0  249.0
호이    21.0  15.0  84.0  120.0
영미    87.0  84.0  76.0  247.0
길동   100.0  87.0  99.0  286.0
또치    59.0  99.0  59.0  217.0
마이클   46.0  77.0  56.0  179.0

In [183]:
del d['합']

In [184]:
d

과목      수학    국어    영어
이름
둘리    84.0  87.0  78.0
호이    21.0  15.0  84.0
영미    87.0  84.0  76.0
길동   100.0  87.0  99.0
또치    59.0  99.0  59.0
마이클   46.0  77.0  56.0

In [185]:
d.drop(['영미', '또치'])

과목      수학    국어    영어
이름
둘리    84.0  87.0  78.0
호이    21.0  15.0  84.0
길동   100.0  87.0  99.0
마이클   46.0  77.0  56.0

In [186]:
d1 = d.drop(['영미', '마이클'])
d1.drop('둘리')

과목     수학    국어    영어
이름
호이   21.0  15.0  84.0
길동  100.0  87.0  99.0
또치   59.0  99.0  59.0

In [189]:
d.drop(['영미', '마이클']).drop('영어', axis = 1)

과목     수학    국어
이름
둘리   84.0  87.0
호이   21.0  15.0
길동  100.0  87.0
또치   59.0  99.0

In [190]:
d.drop(['영미', '마이클']).drop('영어', axis = 1)['수학']

이름
둘리     84.0
호이     21.0
길동    100.0
또치     59.0
Name: 수학, dtype: float64

In [191]:
d.drop(['영미', '마이클']).drop('영어', axis = 1)[['수학']]

과목     수학
이름
둘리   84.0
호이   21.0
길동  100.0
또치   59.0

In [193]:
d.drop('영미')[['수학', '영어']]

과목      수학    영어
이름
둘리    84.0  78.0
호이    21.0  84.0
길동   100.0  99.0
또치    59.0  59.0
마이클   46.0  56.0

In [194]:
d.drop('영미').drop('국어', axis = 1)

과목      수학    영어
이름
둘리    84.0  78.0
호이    21.0  84.0
길동   100.0  99.0
또치    59.0  59.0
마이클   46.0  56.0

In [ ]:
index 변경

특정열로 index 변경하기
d.set_index(열명, inplace = True/False)

예시

In [195]:
d

과목      수학    국어    영어
이름
둘리    84.0  87.0  78.0
호이    21.0  15.0  84.0
영미    87.0  84.0  76.0
길동   100.0  87.0  99.0
또치    59.0  99.0  59.0
마이클   46.0  77.0  56.0

In [196]:
d4 = d.set_index('국어')
d4

과목       수학    영어
국어
87.0   84.0  78.0
15.0   21.0  84.0
84.0   87.0  76.0
87.0  100.0  99.0
99.0   59.0  59.0
77.0   46.0  56.0

In [199]:
d.set_index('국어', inplace = True)

In [200]:
d

과목       수학    영어
국어
87.0   84.0  78.0
15.0   21.0  84.0
84.0   87.0  76.0
87.0  100.0  99.0
99.0   59.0  59.0
77.0   46.0  56.0

In [202]:
d['국어'] = [87, 15, 84, 87, 99, 77]

In [203]:
d

과목       수학    영어  국어
국어
87.0   84.0  78.0  87
15.0   21.0  84.0  15
84.0   87.0  76.0  84
87.0  100.0  99.0  87
99.0   59.0  59.0  99
77.0   46.0  56.0  77

In [204]:
d.set_index('수학')

과목       영어  국어
수학
84.0   78.0  87
21.0   84.0  15
87.0   76.0  84
100.0  99.0  87
59.0   59.0  99
46.0   56.0  77

In [ ]:
# index명과 column명은 유일해야 함
# pivot table 등을 사용함 (추후)

In [207]:
d['이름'] = ['둘리', '호이', '영미', '길동', '또치', '마이클']

In [210]:
d.set_index('이름', inplace = True)

In [211]:
d

과목      수학    영어  국어
이름
둘리    84.0  78.0  87
호이    21.0  84.0  15
영미    87.0  76.0  84
길동   100.0  99.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77

In [ ]:
정렬

열 기준 정렬하기
index 기준: d.sort_index(ascending = True/False)
특정 열 기준: d.sort_values(by = '열명', ascending = True/False)
예시

In [212]:
d.sort_index()

과목      수학    영어  국어
이름
길동   100.0  99.0  87
둘리    84.0  78.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77
영미    87.0  76.0  84
호이    21.0  84.0  15

In [213]:
d

과목      수학    영어  국어
이름
둘리    84.0  78.0  87
호이    21.0  84.0  15
영미    87.0  76.0  84
길동   100.0  99.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77

In [214]:
d.sort_index(inplace = True)

In [215]:
d

과목      수학    영어  국어
이름
길동   100.0  99.0  87
둘리    84.0  78.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77
영미    87.0  76.0  84
호이    21.0  84.0  15

In [216]:
d.sort_values(by = '수학')

과목      수학    영어  국어
이름
호이    21.0  84.0  15
마이클   46.0  56.0  77
또치    59.0  59.0  99
둘리    84.0  78.0  87
영미    87.0  76.0  84
길동   100.0  99.0  87

In [217]:
d

과목      수학    영어  국어
이름
길동   100.0  99.0  87
둘리    84.0  78.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77
영미    87.0  76.0  84
호이    21.0  84.0  15

In [221]:
d.sort_values(by = '수학')

과목      수학    영어  국어
이름
호이    21.0  84.0  15
마이클   46.0  56.0  77
또치    59.0  59.0  99
둘리    84.0  78.0  87
영미    87.0  76.0  84
길동   100.0  99.0  87

In [222]:
d.sort_values(by = '수학', ascending = False)

과목      수학    영어  국어
이름
길동   100.0  99.0  87
영미    87.0  76.0  84
둘리    84.0  78.0  87
또치    59.0  59.0  99
마이클   46.0  56.0  77
호이    21.0  84.0  15

In [223]:
d[1]   # 열 선택은 위치로 안됨

KeyError: 1

In [ ]:
Pandas : Summary
    
DataFrame의 구성
index + columns + 2차원 데이터(values)로 구성

DataFrame의 생성
생성 방법: d = pd.DataFrame(array/dictionary)
    index = array, columns = array 미지정 시 숫자로 자동으로 채워짐
    # array는 리스트 방식으로 넣어줌

In [ ]:
Pandas : Summary
    
DataFrame의 내부 데이터 접근
(사진 2페이지 참조)

d['국어']

d.loc['영미']
d.iloc[2]

d.iloc[행 정보,열 정보]
# 행 정보 선택하는 4가지 방법:
# 행 이름 하나, 행 이름 리스트방식, 행 이름을 콜론으로 슬라이싱, 특정열에 대한 논리식으로 행 선택

In [ ]:
Pandas : Summary
    
DataFrame의 산술, 논리 연산, filtering
    배열, Series와 거의 비슷
    
DataFrame 데이터 추가/삭제
구분:           추가            :         삭제
열  :  d[열명] = 데이터         : del d[열명]
                                : d.drop('열명', axis= 1, inplace = True/False)
행  :  d[index명] = 데이터
      d.loc[index명] = 데이터   : d.drop('index명', inplace = True/False) 

    drop 함수는 리스트 형태로 여러 개 지정 가능
    반환값이라 원본 변경하려면 inplace = True

    # d[열명] = 데이터 : 있던 데이터명 수정, 없던 데이터면 추가
    # drop(), sum() 등의 함수와 같이 양방향 지원시 행이 우선(axis = 0이 기본값)

DataFrame 정렬
    index 기준: d.sort_index(axis= 1, ascending = True/False)
    특정 열 기준: d.sort_values(by = '열명', ascending = True/False)
    # 가로 방향 정렬할 경우 axis = 1 지정

In [ ]:
문제

다음과 같이 실행되는 프로그램을 작성하세요.
입력
• 이름/과목: 띄어쓰기를 구분하여 이름을 입력받음(개수 제한 없음)
• 각 과목별로 입력한 이름 수 만큼 성적을 입력받음(띄어쓰기로 구분)

출력
• 열이름이 과목명, 행이름이 이름인 2차원으로 성적 출력
• 행/열 총합과 평균 출력
• 평균이 60점 이상인 학생 목록 출력하기

In [10]:
import pandas as pd

In [29]:
names = input('이름(띄어쓰기 구분):  ').split()
subjects = input('과목(띄어쓰기 구분):  ').split()

d = pd.DataFrame(index = names)
for s in subjects:
    d[s] = list(map(int, input(' '.join(names)+'의 '+s+' 성적:  ').split()))


#d.loc['과목 합'] = d.sum()   # 재실행하면 합계값이 누적되어서 커짐
d.loc['과목 합'] = d[subjects].sum(axis = 1)
d['평균'] = d[subjects].mean(axis = 1)

d['개인성적 합'] = d.sum(axis = 1)

d

이름(띄어쓰기 구분):  수미 영미 진호
과목(띄어쓰기 구분):  수학 과학
수미 영미 진호의 수학 성적:  10 20 30
수미 영미 진호의 과학 성적:  20 30 40

      수학  과학  개인성적 합
수미    10  20      30
영미    20  30      50
진호    30  40      70
과목 합  60  90     150

In [31]:
# 선생님 정답

names = input('이름(띄어쓰기 구분):  ').split()
subjects = input('과목(띄어쓰기 구분):  ').split()

d = pd.DataFrame(index = names)
for s in subjects:
    d[s] = list(map(int, input(' '.join(names)+'의 '+s+' 성적:  ').split()))


#d.loc['과목 합'] = d.sum()   # 재실행하면 합계값이 누적되어서 커짐

d['합'] = d[subjects].sum(axis = 1)
d['평균'] = d[subjects].mean(axis = 1)

d.loc['합'] = d.loc[names].sum()
d.loc['평균'] = d.loc[names].mean()

이름(띄어쓰기 구분):  수미 진호 영희
과목(띄어쓰기 구분):  수학 과학 국사
수미 진호 영희의 수학 성적:  10 20 30
수미 진호 영희의 과학 성적:  70 80 90
수미 진호 영희의 국사 성적:  90 80 70

In [32]:
d

      수학     과학     국사      합          평균
수미  10.0   70.0   90.0  170.0   56.666667
진호  20.0   80.0   80.0  180.0   60.000000
영희  30.0   90.0   70.0  190.0   63.333333
합   60.0  240.0  240.0  540.0  180.000000
평균  20.0   80.0   80.0  180.0   60.000000

In [34]:
d.loc[d['평균'] >= 60].drop(['합', '평균'])

      수학    과학    국사      합         평균
진호  20.0  80.0  80.0  180.0  60.000000
영희  30.0  90.0  70.0  190.0  63.333333

In [33]:
d1 = d.loc[names]
d1[d1['평균'] >= 60]

      수학    과학    국사      합         평균
진호  20.0  80.0  80.0  180.0  60.000000
영희  30.0  90.0  70.0  190.0  63.333333

In [17]:
d.loc['과목 합'] = d.sum()

In [35]:
sortSel = int(input('정렬기준:  '))
if sortSel == 0: d2 = d1.sort_index()
else: d2 = d1.sort_values(by = d1.columns[sortSel - 1])
d2

정렬기준:  1

      수학    과학    국사      합         평균
수미  10.0  70.0  90.0  170.0  56.666667
진호  20.0  80.0  80.0  180.0  60.000000
영희  30.0  90.0  70.0  190.0  63.333333

In [24]:
del d['개인성적 합']

In [22]:
d.sum??

In [25]:
d

        수학    과학
수미    10.0  20.0
영미    20.0  30.0
과목 합  30.0  50.0

In [26]:
d['개인성적 합'] = d.sum(axis = 1)

In [27]:
d

        수학    과학  개인성적 합
수미    10.0  20.0    30.0
영미    20.0  30.0    50.0
과목 합  30.0  50.0    80.0

In [ ]:
문제 = 심화

다음 기능 추가하기
정렬
0 ~ 과목수의 숫자를 입력받아 내림차순 정렬
0 입력시 이름으로 정렬
1~ 과목수 입력시 과목별 점수에 따라 정렬